peeralliesapp/app/controllers/peer_allies_controller.rb

  def index
    @peer_ally = PeerAlly.all
---
SELECT "peer_allies".* FROM "peer_allies" WHERE "peer_allies"."id" IS NULL LIMIT 1

  def ally_list
    @peer_allies = PeerAlly.all
---
SELECT "peer_allies".* FROM "peer_allies" WHERE "peer_allies"."id" IS NULL LIMIT 1

  def show
    @peer_ally = PeerAlly.find(params[:id])
---
SELECT "peer_allies".* FROM "peer_allies" WHERE "peer_allies"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @peer_ally = PeerAlly.find(params[:id])
---
SELECT "peer_allies".* FROM "peer_allies" WHERE "peer_allies"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @peer_ally = PeerAlly.new(params[:peer_ally])

    if @peer_ally.valid?
      @peer_ally.save
---
INSERT INTO "peer_allies" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 11 Nov 2014 05:31:45 UTC +00:00], ["updated_at", Tue, 11 Nov 2014 05:31:45 UTC +00:00]]