peeralliesapp/app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = PeerAlly.find_by_provider_and_uid(auth["provider"],auth["uid"]) || PeerAlly.create_with_omniauth(auth)
---
SELECT "peer_allies".* FROM "peer_allies" WHERE "peer_allies"."provider" = 'shibboleth' AND "peer_allies"."uid" IS NULL LIMIT 1

  def test_login
    user = PeerAlly.find(params[:user_id])
---
SELECT "peer_allies".* FROM "peer_allies" WHERE "peer_allies"."id" = ? LIMIT 1  [["id", "{:in=>1.0..10.0, :step=>1.0}"]]